tsbiberdorf/sampleLwIPFreeRTOS/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTE0 (number 1), WINC_CHIPEN
  @{ */
#define BOARD_WINC_CHIPEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_WINC_CHIPEN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_CHIPEN_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                     /* @} */

/*! @name PORTE1 (number 2), WINC_MOSI
  @{ */
#define BOARD_WINC_MOSI_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_MOSI_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                   /* @} */

/*! @name PORTE2 (number 3), WINC_SCK
  @{ */
#define BOARD_WINC_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_SCK_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                  /* @} */

/*! @name PORTE3 (number 4), WINC_MISO
  @{ */
#define BOARD_WINC_MISO_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_MISO_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                   /* @} */

/*! @name PORTE4 (number 5), WINC_CS
  @{ */
#define BOARD_WINC_CS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_CS_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                 /* @} */

/*! @name PORTE5 (number 6), WINC_RESET
  @{ */
#define BOARD_WINC_RESET_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_WINC_RESET_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_RESET_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                    /* @} */

/*! @name PORTE6 (number 7), WINC_IRQ
  @{ */
#define BOARD_WINC_IRQ_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_WINC_IRQ_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_WINC_IRQ_PIN 6U     /*!<@brief PORTE pin index: 6 */
                                  /* @} */

/*! @name ADC0_DP1 (number 14), SENSOR_ANODE
  @{ */
/* @} */

/*! @name ADC0_DM1 (number 15), WIFI_ANODE
  @{ */
/* @} */

/*! @name ADC1_DP1 (number 16), POWER_ANODE
  @{ */
/* @} */

/*! @name ADC0_DM0 (number 19), TRIPPED_ANODE
  @{ */
/* @} */

/*! @name ADC0_DP3 (number 20), NGR_FLT_ANODE
  @{ */
/* @} */

/*! @name ADC0_DM3 (number 21), GND_FLT_ANODE
  @{ */
/* @} */

/*! @name ADC1_SE18 (number 26), ADC_24V
  @{ */
/* @} */

/*! @name ADC0_SE23 (number 27), ADC_3V3
  @{ */
/* @} */

/*! @name PORTB20 (number 66), EXTF_CS
  @{ */
#define BOARD_EXTF_CS_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_EXTF_CS_PIN 20U    /*!<@brief PORTB pin index: 20 */
                                 /* @} */

/*! @name PORTB21 (number 67), EXTF_SCK
  @{ */
#define BOARD_EXTF_SCK_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_EXTF_SCK_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                  /* @} */

/*! @name PORTB22 (number 68), EXTF_MOSI
  @{ */
#define BOARD_EXTF_MOSI_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_EXTF_MOSI_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                   /* @} */

/*! @name PORTB23 (number 69), EXTF_MISO
  @{ */
#define BOARD_EXTF_MISO_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_EXTF_MISO_PIN 23U    /*!<@brief PORTB pin index: 23 */
                                   /* @} */

/*! @name PORTC0 (number 70), RELAY_TRIP
  @{ */
#define BOARD_RELAY_TRIP_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_RELAY_TRIP_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_RELAY_TRIP_PIN 0U     /*!<@brief PORTC pin index: 0 */
                                    /* @} */

/*! @name PORTC1 (number 71), RELAY_NGR
  @{ */
#define BOARD_RELAY_NGR_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_RELAY_NGR_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_RELAY_NGR_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                   /* @} */

/*! @name PORTC2 (number 72), RELAY_AUX
  @{ */
#define BOARD_RELAY_AUX_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_RELAY_AUX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_RELAY_AUX_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                   /* @} */

/*! @name PORTC4 (number 76), RELAY_GND
  @{ */
#define BOARD_RELAY_GND_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_RELAY_GND_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_RELAY_GND_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                   /* @} */

/*! @name PORTC8 (number 80), WIFI_ENABLE
  @{ */
#define BOARD_WIFI_ENABLE_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_WIFI_ENABLE_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_WIFI_ENABLE_PIN 8U     /*!<@brief PORTC pin index: 8 */
                                     /* @} */

/*! @name PORTC9 (number 81), TEST_P
  @{ */
#define BOARD_TEST_P_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_TEST_P_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_TEST_P_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                /* @} */

/*! @name PORTC10 (number 82), RESET_P
  @{ */
#define BOARD_RESET_P_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_RESET_P_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_RESET_P_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                 /* @} */

