tsbiberdorf/sampleLwIPFreeRTOS/board/pin_mux.h
/*! @name PORTC16 (number 90), HMI_RS485_RX
  @{ */
#define BOARD_HMI_RS485_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_HMI_RS485_RX_PIN 16U    /*!<@brief PORTC pin index: 16 */
                                      /* @} */

/*! @name PORTC17 (number 91), HMI_RS485_TX
  @{ */
#define BOARD_HMI_RS485_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_HMI_RS485_TX_PIN 17U    /*!<@brief PORTC pin index: 17 */
                                      /* @} */

/*! @name PORTC18 (number 92), HMI_RS485_DIR
  @{ */
#define BOARD_HMI_RS485_DIR_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_HMI_RS485_DIR_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_HMI_RS485_DIR_PIN 18U    /*!<@brief PORTC pin index: 18 */
                                       /* @} */

/*! @name PORTD2 (number 95), SENSOR_RS485_RX
  @{ */
#define BOARD_SENSOR_RS485_RX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SENSOR_RS485_RX_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                         /* @} */

/*! @name PORTD3 (number 96), SENSOR_RS485_TX
  @{ */
#define BOARD_SENSOR_RS485_TX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SENSOR_RS485_TX_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                         /* @} */

/*! @name PORTD0 (number 93), SENSOR_RS485_DIR
  @{ */
#define BOARD_SENSOR_RS485_DIR_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_SENSOR_RS485_DIR_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SENSOR_RS485_DIR_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                          /* @} */

/*! @name PORTD4 (number 97), POWER_LED
  @{ */
#define BOARD_POWER_LED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_POWER_LED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_POWER_LED_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                   /* @} */

/*! @name PORTD5 (number 98), WIFI_LED
  @{ */
#define BOARD_WIFI_LED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_WIFI_LED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_WIFI_LED_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                  /* @} */

/*! @name PORTD6 (number 99), SENSOR_LED
  @{ */
#define BOARD_SENSOR_LED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_SENSOR_LED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SENSOR_LED_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                    /* @} */

/*! @name PORTC6 (number 78), NGR_FLT_LED
  @{ */
#define BOARD_NGR_FLT_LED_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_NGR_FLT_LED_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_NGR_FLT_LED_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                     /* @} */

/*! @name PORTC7 (number 79), GND_FLT_LED
  @{ */
#define BOARD_GND_FLT_LED_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_GND_FLT_LED_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_GND_FLT_LED_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                     /* @} */

/*! @name PORTC5 (number 77), TRIPPED_LED
  @{ */
#define BOARD_TRIPPED_LED_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_TRIPPED_LED_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_TRIPPED_LED_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC6 (number 78), NGR_FLT_LED
  @{ */
#define BOARD_SW2_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_SW2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SW2_PIN 6U     /*!<@brief PORTC pin index: 6 */
                             /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */
#define BOARD_SW3_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_SW3_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SW3_PIN 4U     /*!<@brief PORTA pin index: 4 */
                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*! @name PORTB21 (number 67), EXTF_SCK
  @{ */
#define BOARD_LED_BLUE_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_LED_BLUE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_LED_BLUE_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                  /* @} */

/*! @name PORTB22 (number 68), EXTF_MOSI
  @{ */
#define BOARD_LED_RED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_LED_RED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_LED_RED_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                 /* @} */

/*! @name PORTE26 (number 33), J2[1]/D12[4]/LEDRGB_GREEN
  @{ */
#define BOARD_LED_GREEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_GREEN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_LED_GREEN_PIN 26U    /*!<@brief PORTE pin index: 26 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB17 (number 63), U10[1]/UART0_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                       /* @} */

/*! @name PORTB16 (number 62), U7[4]/UART0_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

